Revit 2026 API

# ParameterTypeIdRbsEnergyAnalysisViewOuterShellMode Property

---

"Show Analytical Space Shells"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId RbsEnergyAnalysisViewOuterShellMode { get; }
```
```vb
Public Shared ReadOnly Property RbsEnergyAnalysisViewOuterShellMode As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ RbsEnergyAnalysisViewOuterShellMode {
	ForgeTypeId^ get ();
}
```
```fsharp
static member RbsEnergyAnalysisViewOuterShellMode : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace